<template>
    <page link="docs.htm">
        <div class="container-fluid">
            <div class="row">
                <div class="col-12">
                    <h2>Правила</h2>
                    <div style="padding-bottom:7px;font-size:120%;font-weight:bold;text-decoration: underline;color:#555555;">
                        Привет. Теперь ты можешь редактировать каталог водных препятствий. Прочитай эти правила и
                        соблюдай их в дальнейшем.
                    </div>
                    <ol>
                        <li>Тут нельзя размещать рекламу, запрещённые материалы и прочее разжигание</li>
                        <li>Любые данные, которые ты сюда добавляешь должны быть максимально точными и объективными. Люди
                            будут руководствоваться ими на сплаве.
                        </li>
                        <li>Всё, что ты сюда вносишь, становится общественным достоянием и размещается в том числе на сайтах-партнёрах. Это касается точек, описаний и фотографий.
                        </li>
                        <li>Точка препятствия ставится в начале порога, например, на заходной шивере. Она не должна быть на
                            берегу, в центре порога или на выходе из него.
                        </li>
                    </ol>
                </div>
            </div>
        </div>
    </page>
</template>

<script>
    export default {
        data() {
            return {
            };
        }
    }
</script>
